#include <stdio.h>

// 只读指针变量与只读变量指针
int main(void)
{
    int a = 1;

    printf("只读指针变量(一个const的指针指向了一个int的变量)===================================================================\n");
    // 技巧：从后往前读
    // 只读指针变量(一个const的指针指向了一个int的变量)
    int *const cp = &a;
    // 只读指针，可以修改值，但不能改变指向
    *cp = 100;
    printf("a=%d, *cp=%d\n", a, *cp); // a=100, *cp=100
    // int a1 = 1000;
    // cp = &a1; 只读指针不能修改其指向
    printf("\n");

    //==========================================================================
    // 只读变量指针(一个指针指向了一个const的int变量)
    printf("只读变量指针(一个指针指向了一个const的int变量)===================================================================\n");
    int const *cp2 = &a;
    // 只读变量指针，变量不可被修改，但可以改变指向
    int c = 10;
    cp2 = &c;
    printf("a=%d, c=%d, *cp2=%d\n", a, c, *cp2); // a=100, c=10, *cp2=10
    // *cp2 = 100; 变量不可被修改

    //==========================================================================
    // 一个const的指针指向了一个const的int变量
    int const *const cpp = &a;
    // 不能改指向，也不能改其值
    // *cpp = 100; error
    // *cpp = &b; error
    return 0;
}
